In [2]:
import pandas as pd

In [3]:
# creating a dataframe from a dictionary
data = {'name': ['Alice', 'Bob', 'Charlie', 'David'],
        'age': [25, 30, 35, 40],
        'gender': ['F', 'M', 'M', 'M']}
index=["index0","index1","index2","index3"]
df = pd.DataFrame(data,index=index)

# creating a dataframe from a list of lists
# data = [['Alice', 25, 'F'], 
#         ['Bob', 30, 'M'], 
#         ['Charlie', 35, 'M'], 
#         ['David', 40, 'M']]
# df = pd.DataFrame(data, columns=['name', 'age', 'gender'])

In [4]:
df

           name  age gender
index0    Alice   25      F
index1      Bob   30      M
index2  Charlie   35      M
index3    David   40      M

In [5]:
# Selecting Rows and Columns
# You can select specific rows and columns from a DataFrame using the .loc[] and .iloc[] methods.

In [6]:
# selecting a column
name_col = df['name']
name_col

index0      Alice
index1        Bob
index2    Charlie
index3      David
Name: name, dtype: object

In [7]:
# selecting multiple columns
name_age_cols = df[['name', 'age']]
name_age_cols

           name  age
index0    Alice   25
index1      Bob   30
index2  Charlie   35
index3    David   40

In [8]:
# selecting a row by label
row1 = df.loc["index0"]
row1
# selecting a row by index
row2 = df.iloc[0]
row2

name      Alice
age          25
gender        F
Name: index0, dtype: object

In [9]:
# selecting multiple rows by label
rows = df.loc["index0":"index1"]
rows
# selecting multiple rows by index
rows = df.iloc[0:1]

In [10]:
# filtering rows where age is greater than 30
df_filtered = df[df['age'] > 30]
df_filtered

           name  age gender
index2  Charlie   35      M
index3    David   40      M

In [11]:
# applying a function to a column
df['age_squared'] = df['age'].apply(lambda x: x**2)
df

           name  age gender  age_squared
index0    Alice   25      F          625
index1      Bob   30      M          900
index2  Charlie   35      M         1225
index3    David   40      M         1600

In [12]:
# sorting by age
df_sorted = df.sort_values('age')
df_sorted

           name  age gender  age_squared
index0    Alice   25      F          625
index1      Bob   30      M          900
index2  Charlie   35      M         1225
index3    David   40      M         1600

In [13]:
# sorting by multiple columns
df_sorted = df.sort_values(['gender', 'age'])
df_sorted

           name  age gender  age_squared
index0    Alice   25      F          625
index1      Bob   30      M          900
index2  Charlie   35      M         1225
index3    David   40      M         1600

In [14]:
# ranking by age
df['age_rank'] = df['age'].rank()
df

           name  age gender  age_squared  age_rank
index0    Alice   25      F          625       1.0
index1      Bob   30      M          900       2.0
index2  Charlie   35      M         1225       3.0
index3    David   40      M         1600       4.0

In [15]:
# # dropping rows with missing values
# df_dropped = df.dropna()

# # filling missing values with a specific value
# df_filled = df.fillna(0)

# # filling missing values with the mean of the column
# df_mean_filled = df.fillna(df.mean())